In [1]:
# Assign value

In [4]:
import numpy as np
import pandas as pd

d1 = np.array([np.NaN,5,np.NaN, 3,4,11, 12, 17])
d2 = np.array([1,np.NaN, 2,11,np.NaN, 7, np.NaN, 12])
d3 = np.array([23,2,1,np.NaN, np.NaN, 32,np.NaN, np.NaN])

df = pd.DataFrame({
    "d1":d1, "d2":d2, "d3":d3
})

In [5]:
df.apply(lambda x: x.fillna(x.mean()), axis=0)

          d1    d2    d3
0   8.666667   1.0  23.0
1   5.000000   6.6   2.0
2   8.666667   2.0   1.0
3   3.000000  11.0  14.5
4   4.000000   6.6  14.5
5  11.000000   7.0  32.0
6  12.000000   6.6  14.5
7  17.000000  12.0  14.5

In [6]:
df.fillna(df.mean()[:])

          d1    d2    d3
0   8.666667   1.0  23.0
1   5.000000   6.6   2.0
2   8.666667   2.0   1.0
3   3.000000  11.0  14.5
4   4.000000   6.6  14.5
5  11.000000   7.0  32.0
6  12.000000   6.6  14.5
7  17.000000  12.0  14.5

In [7]:
df.where(pd.notna(df),df.mean(),axis="columns")

          d1    d2    d3
0   8.666667   1.0  23.0
1   5.000000   6.6   2.0
2   8.666667   2.0   1.0
3   3.000000  11.0  14.5
4   4.000000   6.6  14.5
5  11.000000   7.0  32.0
6  12.000000   6.6  14.5
7  17.000000  12.0  14.5

In [12]:
departman = ["IT","HR","IT","IT","HR","CM","IT"]
price = [5,5,7,6,6,5,8]
year = [2,3,3,2,2,1,5]

d1 = np.array(departman)
d2 = np.array(price)
d3 = np.array(year)

data = pd.DataFrame({
    "departman":d1, "price":price, "year":year
})

In [13]:
data

  departman  price  year
0        IT      5     2
1        HR      5     3
2        IT      7     3
3        IT      6     2
4        HR      6     2
5        CM      5     1
6        IT      8     5

In [14]:
data.groupby("departman")["price"].mean()

departman
CM    5.0
HR    5.5
IT    6.5
Name: price, dtype: float64

In [16]:
data["price"].fillna(data.groupby("departman")["price"].transform("mean"))

0    5
1    5
2    7
3    6
4    6
5    5
6    8
Name: price, dtype: int64

In [20]:
e1 = np.array([2,3,np.NaN, 3, np.NaN,6])
e2 = np.array(["IT","HR",np.NaN, "IT",np.NaN,np.nan], dtype=object)

In [21]:
data1 = pd.DataFrame({
    "year": e1, "departman":e2
})

In [22]:
data1

   year departman
0   2.0        IT
1   3.0        HR
2   NaN       NaN
3   3.0        IT
4   NaN       NaN
5   6.0       NaN

In [24]:
data1["departman"].fillna(data1["departman"].mode()[0])

0    IT
1    HR
2    IT
3    IT
4    IT
5    IT
Name: departman, dtype: object

In [25]:
data1["departman"].fillna(method="bfill")

0     IT
1     HR
2     IT
3     IT
4    NaN
5    NaN
Name: departman, dtype: object

In [26]:
data1["departman"].fillna(method="ffill")

0    IT
1    HR
2    HR
3    IT
4    IT
5    IT
Name: departman, dtype: object

In [27]:
# Predictive value assignment

In [28]:
import seaborn as sns
import missingno as msno

dt = sns.load_dataset("titanic")
dt = dt.select_dtypes(include=["float64","int64"])

In [29]:
dt

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [30]:
dt.isnull().sum()

survived      0
pclass        0
age         177
sibsp         0
parch         0
fare          0
dtype: int64

In [32]:
# !pip install ycimpute

In [33]:
from ycimpute.imputer import knnimput

In [34]:
var_list = list(dt)

In [35]:
n_data = np.array(dt)

In [36]:
n_data

array([[ 0.    ,  3.    , 22.    ,  1.    ,  0.    ,  7.25  ],
       [ 1.    ,  1.    , 38.    ,  1.    ,  0.    , 71.2833],
       [ 1.    ,  3.    , 26.    ,  0.    ,  0.    ,  7.925 ],
       ...,
       [ 0.    ,  3.    ,     nan,  1.    ,  2.    , 23.45  ],
       [ 1.    ,  1.    , 26.    ,  0.    ,  0.    , 30.    ],
       [ 0.    ,  3.    , 32.    ,  0.    ,  0.    ,  7.75  ]])

In [37]:
n_data.shape

(891, 6)

In [39]:
dt_f = knnimput.KNN(k=4).complete(n_data)

Imputing row 1/891 with 0 missing, elapsed time: 0.111
Imputing row 101/891 with 0 missing, elapsed time: 0.115
Imputing row 201/891 with 0 missing, elapsed time: 0.116
Imputing row 301/891 with 1 missing, elapsed time: 0.116
Imputing row 401/891 with 0 missing, elapsed time: 0.117
Imputing row 501/891 with 0 missing, elapsed time: 0.118
Imputing row 601/891 with 0 missing, elapsed time: 0.118
Imputing row 701/891 with 0 missing, elapsed time: 0.119
Imputing row 801/891 with 0 missing, elapsed time: 0.119

In [40]:
type(dt_f)

numpy.ndarray

In [42]:
d_pf = pd.DataFrame(dt_f,columns=var_list)

In [43]:
# random forests

In [53]:
import seaborn as sns
import missingno as msno
from ycimpute.imputer import iterforest

dt1 = sns.load_dataset("titanic")
dt1 = dt1.select_dtypes(include=["float64","int64"])

In [54]:
var_names = list(dt1)

In [55]:
n_df = np.array(df)

In [57]:
from ycimpute.imputer import EM

In [58]:
data2 = EM().complete(n_df)

In [60]:
dps = pd.DataFrame(data2)

In [61]:
dps

      0     1     2
0   0.0   1.0  23.0
1   5.0   0.0   2.0
2   0.0   2.0   1.0
3   3.0  11.0   0.0
4   4.0   0.0   0.0
5  11.0   7.0  32.0
6  12.0   0.0   0.0
7  17.0  12.0   0.0